{
  "channel_id": "cbse_class10_science",
  "channel_name": "CBSE Class 10 Science",
  "class": "10",
  "subject": "Science",
  "chapter_id": "chemical_reactions_and_equations",
  "chapter_name": "Chemical Reactions and Equations",
  "lessons": [
    {
      "lesson_id": "lesson_01_introduction_chemical_reactions",
      "lesson_title": "Introduction to Chemical Reactions",
      "content_type": "theory",
      "content": "Consider the following situations of daily life and think what happens when –\n\n• milk is left at room temperature during summers.\n• an iron tawa/pan/nail is left exposed to humid atmosphere.\n• grapes get fermented.\n• food is cooked.\n• food gets digested in our body.\n• we respire.\n\nIn all the above situations, the nature and the identity of the initial substance have somewhat changed. We have already learnt about physical and chemical changes of matter in our previous classes. Whenever a chemical change occurs, we can say that a chemical reaction has taken place.\n\nFrom activities involving burning of magnesium, mixing of lead nitrate with potassium iodide, and adding dilute sulphuric acid to zinc granules, we can say that any of the following observations helps us to determine whether a chemical reaction has taken place –\n\n• change in state\n• change in colour\n• evolution of a gas\n• change in temperature\n\nAs we observe the changes around us, we can see that there is a large variety of chemical reactions taking place around us."
    },
    {
      "lesson_id": "lesson_02_chemical_equations_introduction",
      "lesson_title": "Chemical Equations – Introduction and Word Equations",
      "content_type": "theory",
      "content": "When a magnesium ribbon is burnt in oxygen, it gets converted to magnesium oxide. This description of a chemical reaction in a sentence form is quite long. It can be written in a shorter form. The simplest way to do this is to write it in the form of a word-equation.\n\nThe word-equation for the above reaction would be –\n\n    Magnesium + Oxygen → Magnesium oxide\n    (Reactants)              (Product)\n\nThe substances that undergo chemical change in the reaction, magnesium and oxygen, are the reactants. The new substance is magnesium oxide, formed during the reaction, as a product.\n\nA word-equation shows change of reactants to products through an arrow placed between them. The reactants are written on the left-hand side (LHS) with a plus sign (+) between them. Similarly, products are written on the right-hand side (RHS) with a plus sign (+) between them. The arrowhead points towards the products, and shows the direction of the reaction."
    },
    {
      "lesson_id": "lesson_03_writing_chemical_equation",
      "lesson_title": "Writing a Chemical Equation Using Formulae",
      "content_type": "theory",
      "content": "Chemical equations can be made more concise and useful if we use chemical formulae instead of words. A chemical equation represents a chemical reaction. If we recall formulae of magnesium, oxygen and magnesium oxide, the above word-equation can be written as –\n\n    Mg + O₂ → MgO\n\nCount and compare the number of atoms of each element on the LHS and RHS of the arrow. Is the number of atoms of each element the same on both the sides? If yes, then the equation is balanced. If not, then the equation is unbalanced because the mass is not the same on both sides of the equation. Such a chemical equation is a skeletal chemical equation for a reaction. The equation above is a skeletal chemical equation for the burning of magnesium in air."
    },
    {
      "lesson_id": "lesson_04_balanced_chemical_equations",
      "lesson_title": "Balanced Chemical Equations – Law of Conservation of Mass",
      "content_type": "theory",
      "content": "Recall the law of conservation of mass that you studied in Class IX; mass can neither be created nor destroyed in a chemical reaction. That is, the total mass of the elements present in the products of a chemical reaction has to be equal to the total mass of the elements present in the reactants.\n\nIn other words, the number of atoms of each element remains the same, before and after a chemical reaction. Hence, we need to balance a skeletal chemical equation.\n\nExample: The word-equation for the reaction of zinc with sulphuric acid may be represented as –\n\n    Zinc + Sulphuric acid → Zinc sulphate + Hydrogen\n\nThe chemical equation is –\n\n    Zn + H₂SO₄ → ZnSO₄ + H₂\n\nLet us examine the number of atoms of different elements on both sides of the arrow:\n\n    Element | Atoms in reactants (LHS) | Atoms in products (RHS)\n    Zn      |           1              |           1\n    H       |           2              |           2\n    S       |           1              |           1\n    O       |           4              |           4\n\nAs the number of atoms of each element is the same on both sides of the arrow, this is a balanced chemical equation."
    },
    {
      "lesson_id": "lesson_05_balancing_equations_hit_and_trial",
      "lesson_title": "Steps for Balancing a Chemical Equation – Hit and Trial Method",
      "content_type": "theory",
      "content": "To balance a chemical equation, we follow a step-by-step process. Consider the unbalanced equation:\n\n    Fe + H₂O → Fe₃O₄ + H₂\n\nStep I: Draw boxes around each formula. Do not change anything inside the boxes while balancing the equation.\n\nStep II: List the number of atoms of different elements present in the unbalanced equation.\n\n    Element | Atoms in reactants (LHS) | Atoms in products (RHS)\n    Fe      |           1              |           3\n    H       |           2              |           2\n    O       |           1              |           4\n\nStep III: It is often convenient to start balancing with the compound that contains the maximum number of atoms. It may be a reactant or a product. In that compound, select the element which has the maximum number of atoms. Using these criteria, we select Fe₃O₄ and the element oxygen in it. There are four oxygen atoms on the RHS and only one on the LHS.\n\nTo balance the oxygen atoms, put coefficient '4' before H₂O:\n\n    Fe + 4H₂O → Fe₃O₄ + H₂  (partly balanced equation)\n\nStep IV: Fe and H atoms are still not balanced. To equalise the number of H atoms, make the number of molecules of hydrogen as four on the RHS:\n\n    Fe + 4H₂O → Fe₃O₄ + 4H₂  (partly balanced equation)\n\nStep V: Examine the above equation and pick up the third element which is not balanced — iron. To equalise Fe, we take three atoms of Fe on the LHS:\n\n    3Fe + 4H₂O → Fe₃O₄ + 4H₂\n\nStep VI: Finally, to check the correctness of the balanced equation, we count atoms of each element on both sides of the equation:\n\n    3Fe + 4H₂O → Fe₃O₄ + 4H₂\n\nThe numbers of atoms of elements on both sides are equal. This equation is now balanced. This method of balancing chemical equations is called hit-and-trial method as we make trials to balance the equation by using the smallest whole number coefficient.\n\nStep VII – Writing Symbols of Physical States: To make a chemical equation more informative, the physical states of the reactants and products are mentioned along with their chemical formulae. The gaseous, liquid, aqueous and solid states of reactants and products are represented by the notations (g), (l), (aq) and (s), respectively. The word aqueous (aq) is written if the reactant or product is present as a solution in water.\n\nThe balanced equation becomes:\n\n    3Fe(s) + 4H₂O(g) → Fe₃O₄(s) + 4H₂(g)\n\nNote that the symbol (g) is used with H₂O to indicate that in this reaction water is used in the form of steam.\n\nUsually physical states are not included in a chemical equation unless it is necessary to specify them.\n\nSometimes the reaction conditions, such as temperature, pressure, catalyst, etc., for the reaction are indicated above and/or below the arrow in the equation. For example:\n\n    CO(g) + 2H₂(g) → (340 atm) → CH₃OH(l)\n\n    6CO₂(aq) + 12H₂O(l) → (Sunlight / Chlorophyll) → C₆H₁₂O₆(aq) + 6O₂(aq) + 6H₂O(l)\n                                                        (Glucose)"
    },
    {
      "lesson_id": "lesson_06_types_of_reactions_combination",
      "lesson_title": "Types of Chemical Reactions – Combination Reaction",
      "content_type": "theory",
      "content": "During a chemical reaction atoms of one element do not change into those of another element. Nor do atoms disappear from the mixture or appear from elsewhere. Actually, chemical reactions involve the breaking and making of bonds between atoms to produce new substances.\n\nCombination Reaction:\n\nCalcium oxide reacts vigorously with water to produce slaked lime (calcium hydroxide) releasing a large amount of heat.\n\n    CaO(s) + H₂O(l) → Ca(OH)₂(aq) + Heat\n    (Quick lime)          (Slaked lime)\n\nIn this reaction, calcium oxide and water combine to form a single product, calcium hydroxide. Such a reaction in which a single product is formed from two or more reactants is known as a combination reaction.\n\nMore examples of combination reactions:\n\n(i) Burning of coal:\n    C(s) + O₂(g) → CO₂(g)\n\n(ii) Formation of water from H₂(g) and O₂(g):\n    2H₂(g) + O₂(g) → 2H₂O(l)\n\nIn simple language we can say that when two or more substances (elements or compounds) combine to form a single product, the reactions are called combination reactions.\n\nExothermic Reactions:\n\nReactions in which heat is released along with the formation of products are called exothermic chemical reactions.\n\nOther examples of exothermic reactions are –\n\n(i) Burning of natural gas:\n    CH₄(g) + 2O₂(g) → CO₂(g) + 2H₂O(g)\n\n(ii) Respiration is an exothermic process:\n    C₆H₁₂O₆(aq) + 6O₂(aq) → 6CO₂(aq) + 6H₂O(l) + energy\n    (Glucose)\n\nDuring digestion, food is broken down into simpler substances. Carbohydrates are broken down to form glucose. This glucose combines with oxygen in the cells of our body and provides energy. The special name of this reaction is respiration.\n\n(iii) The decomposition of vegetable matter into compost is also an example of an exothermic reaction.\n\nDo You Know? A solution of slaked lime produced by the reaction of calcium oxide with water is used for whitewashing walls. Calcium hydroxide reacts slowly with the carbon dioxide in air to form a thin layer of calcium carbonate on the walls. Calcium carbonate is formed after two to three days of whitewashing and gives a shiny finish to the walls. It is interesting to note that the chemical formula for marble is also CaCO₃.\n\n    Ca(OH)₂(aq) + CO₂(g) → CaCO₃(s) + H₂O(l)\n    (Calcium hydroxide)      (Calcium carbonate)"
    },
    {
      "lesson_id": "lesson_07_types_of_reactions_decomposition",
      "lesson_title": "Types of Chemical Reactions – Decomposition Reaction",
      "content_type": "theory",
      "content": "Decomposition Reaction:\n\nWhen ferrous sulphate crystals are heated, the green colour of the ferrous sulphate crystals changes and one can smell the characteristic odour of burning sulphur.\n\n    2FeSO₄(s) → (Heat) → Fe₂O₃(s) + SO₂(g) + SO₃(g)\n    (Ferrous sulphate)     (Ferric oxide)\n\nIn this reaction a single reactant breaks down to give simpler products. This is a decomposition reaction. Ferrous sulphate crystals (FeSO₄.7H₂O) lose water when heated and the colour of the crystals changes. It then decomposes to ferric oxide (Fe₂O₃), sulphur dioxide (SO₂) and sulphur trioxide (SO₃). Ferric oxide is a solid, while SO₂ and SO₃ are gases.\n\nDecomposition of calcium carbonate to calcium oxide and carbon dioxide on heating is an important decomposition reaction used in various industries. Calcium oxide is called lime or quick lime. It has many uses – one is in the manufacture of cement. When a decomposition reaction is carried out by heating, it is called thermal decomposition.\n\n    CaCO₃(s) → (Heat) → CaO(s) + CO₂(g)\n    (Limestone)            (Quick lime)\n\nThermal decomposition of lead nitrate:\n\n    2Pb(NO₃)₂(s) → (Heat) → 2PbO(s) + 4NO₂(g) + O₂(g)\n    (Lead nitrate)             (Lead oxide)(Nitrogen dioxide)(Oxygen)\n\nBrown fumes of nitrogen dioxide (NO₂) are emitted in this reaction.\n\nElectrolysis of water (decomposition by electricity):\nWhen electric current is passed through water (with a few drops of dilute sulphuric acid added), gases are produced at both electrodes. Hydrogen is collected at one electrode and oxygen at the other. The volume of hydrogen collected is double that of oxygen.\n\nDecomposition of silver chloride by light:\n    2AgCl(s) → (Sunlight) → 2Ag(s) + Cl₂(g)\n\nWhite silver chloride turns grey in sunlight. This is due to the decomposition of silver chloride into silver and chlorine by light.\n\nSilver bromide also behaves in the same way:\n    2AgBr(s) → (Sunlight) → 2Ag(s) + Br₂(g)\n\nThe above reactions are used in black and white photography.\n\nEndothermic Reactions:\n\nThe decomposition reactions require energy either in the form of heat, light or electricity for breaking down the reactants. Reactions in which energy is absorbed are known as endothermic reactions."
    },
    {
      "lesson_id": "lesson_08_types_of_reactions_displacement",
      "lesson_title": "Types of Chemical Reactions – Displacement Reaction",
      "content_type": "theory",
      "content": "Displacement Reaction:\n\nWhen iron nails are immersed in copper sulphate solution, the iron nail becomes brownish in colour and the blue colour of the copper sulphate solution fades.\n\nThe following chemical reaction takes place:\n\n    Fe(s) + CuSO₄(aq) → FeSO₄(aq) + Cu(s)\n    (Copper sulphate)    (Iron sulphate)\n\nIn this reaction, iron has displaced or removed another element, copper, from copper sulphate solution. This reaction is known as a displacement reaction.\n\nOther examples of displacement reactions:\n\n    Zn(s) + CuSO₄(aq) → ZnSO₄(aq) + Cu(s)\n    (Copper sulphate)     (Zinc sulphate)\n\n    Pb(s) + CuCl₂(aq) → PbCl₂(aq) + Cu(s)\n    (Copper chloride)    (Lead chloride)\n\nZinc and lead are more reactive elements than copper. They displace copper from its compounds."
    },
    {
      "lesson_id": "lesson_09_types_of_reactions_double_displacement",
      "lesson_title": "Types of Chemical Reactions – Double Displacement Reaction",
      "content_type": "theory",
      "content": "Double Displacement Reaction:\n\nWhen sodium sulphate solution and barium chloride solution are mixed, a white substance which is insoluble in water is formed. This insoluble substance formed is known as a precipitate. Any reaction that produces a precipitate can be called a precipitation reaction.\n\n    Na₂SO₄(aq) + BaCl₂(aq) → BaSO₄(s) + 2NaCl(aq)\n    (Sodium     (Barium      (Barium    (Sodium\n    sulphate)   chloride)    sulphate)  chloride)\n\nThe white precipitate of BaSO₄ is formed by the reaction of SO₄²⁻ and Ba²⁺. The other product formed is sodium chloride which remains in the solution. Such reactions in which there is an exchange of ions between the reactants are called double displacement reactions."
    },
    {
      "lesson_id": "lesson_10_oxidation_and_reduction",
      "lesson_title": "Oxidation and Reduction – Redox Reactions",
      "content_type": "theory",
      "content": "Oxidation and Reduction:\n\nWhen copper powder is heated, the surface of copper powder becomes coated with black copper(II) oxide. This is because oxygen is added to copper and copper oxide is formed.\n\n    2Cu + O₂ → (Heat) → 2CuO\n\nIf hydrogen gas is passed over this heated material (CuO), the black coating on the surface turns brown as the reverse reaction takes place and copper is obtained.\n\n    CuO + H₂ → (Heat) → Cu + H₂O\n\nIf a substance gains oxygen during a reaction, it is said to be oxidised.\nIf a substance loses oxygen during a reaction, it is said to be reduced.\n\nDuring this reaction, the copper(II) oxide is losing oxygen and is being reduced. The hydrogen is gaining oxygen and is being oxidised. In other words, one reactant gets oxidised while the other gets reduced during a reaction. Such reactions are called oxidation-reduction reactions or redox reactions.\n\n    CuO + H₂ → (Heat) → Cu + H₂O\n    [Oxidation: H₂ gains oxygen]\n    [Reduction: CuO loses oxygen]\n\nSome other examples of redox reactions are:\n\n    ZnO + C → Zn + CO\n    MnO₂ + 4HCl → MnCl₂ + 2H₂O + Cl₂\n\nIn reaction (ZnO + C): carbon is oxidised to CO and ZnO is reduced to Zn.\nIn reaction (MnO₂ + 4HCl): HCl is oxidised to Cl₂ whereas MnO₂ is reduced to MnCl₂.\n\nFrom the above examples we can say that if a substance gains oxygen or loses hydrogen during a reaction, it is oxidised. If a substance loses oxygen or gains hydrogen during a reaction, it is reduced."
    },
    {
      "lesson_id": "lesson_11_effects_of_oxidation_corrosion",
      "lesson_title": "Effects of Oxidation in Everyday Life – Corrosion",
      "content_type": "theory",
      "content": "Corrosion:\n\nIron articles are shiny when new, but get coated with a reddish brown powder when left for some time. This process is commonly known as rusting of iron. Some other metals also get tarnished in this manner.\n\nWhen a metal is attacked by substances around it such as moisture, acids, etc., it is said to corrode and this process is called corrosion. The black coating on silver and the green coating on copper are other examples of corrosion.\n\nCorrosion causes damage to car bodies, bridges, iron railings, ships and to all objects made of metals, specially those of iron. Corrosion of iron is a serious problem. Every year an enormous amount of money is spent to replace damaged iron."
    },
    {
      "lesson_id": "lesson_12_effects_of_oxidation_rancidity",
      "lesson_title": "Effects of Oxidation in Everyday Life – Rancidity",
      "content_type": "theory",
      "content": "Rancidity:\n\nWhen fats and oils are oxidised, they become rancid and their smell and taste change. Usually substances which prevent oxidation (antioxidants) are added to foods containing fats and oil. Keeping food in air tight containers helps to slow down oxidation.\n\nChips manufacturers usually flush bags of chips with gas such as nitrogen to prevent the chips from getting oxidised."
    },
    {
      "lesson_id": "lesson_13_chapter_summary",
      "lesson_title": "Chapter Summary – What You Have Learnt",
      "content_type": "theory",
      "content": "• A complete chemical equation represents the reactants, products and their physical states symbolically.\n\n• A chemical equation is balanced so that the numbers of atoms of each type involved in a chemical reaction are the same on the reactant and product sides of the equation. Equations must always be balanced.\n\n• In a combination reaction two or more substances combine to form a new single substance.\n\n• Decomposition reactions are opposite to combination reactions. In a decomposition reaction, a single substance decomposes to give two or more substances.\n\n• Reactions in which heat is given out along with the products are called exothermic reactions.\n\n• Reactions in which energy is absorbed are known as endothermic reactions.\n\n• When an element displaces another element from its compound, a displacement reaction occurs.\n\n• Two different atoms or groups of atoms (ions) are exchanged in double displacement reactions.\n\n• Precipitation reactions produce insoluble salts.\n\n• Reactions also involve the gain or loss of oxygen or hydrogen by substances. Oxidation is the gain of oxygen or loss of hydrogen. Reduction is the loss of oxygen or gain of hydrogen."
    },
    {
      "lesson_id": "lesson_14_key_definitions",
      "lesson_title": "Key Definitions",
      "content_type": "definition",
      "content": "1. Chemical Reaction: A process in which the nature and identity of the initial substance changes. It involves the breaking and making of bonds between atoms to produce new substances.\n\n2. Reactants: The substances that undergo chemical change in a reaction. Written on the left-hand side (LHS) of a chemical equation.\n\n3. Products: The new substances formed during a chemical reaction. Written on the right-hand side (RHS) of a chemical equation.\n\n4. Skeletal Chemical Equation: A chemical equation that is not balanced — the number of atoms of each element is not equal on both sides.\n\n5. Balanced Chemical Equation: A chemical equation in which the number of atoms of each element is equal on both the reactant and product sides.\n\n6. Combination Reaction: A reaction in which a single product is formed from two or more reactants.\n\n7. Decomposition Reaction: A reaction in which a single substance decomposes to give two or more substances. It is the opposite of a combination reaction.\n\n8. Thermal Decomposition: A decomposition reaction carried out by heating.\n\n9. Exothermic Reaction: A reaction in which heat is released along with the formation of products.\n\n10. Endothermic Reaction: A reaction in which energy is absorbed.\n\n11. Displacement Reaction: A reaction in which a more reactive element displaces a less reactive element from its compound.\n\n12. Double Displacement Reaction: A reaction in which there is an exchange of ions between the reactants.\n\n13. Precipitate: An insoluble substance formed during a reaction in solution.\n\n14. Precipitation Reaction: Any reaction that produces a precipitate.\n\n15. Oxidation: Gain of oxygen or loss of hydrogen by a substance during a reaction.\n\n16. Reduction: Loss of oxygen or gain of hydrogen by a substance during a reaction.\n\n17. Redox Reaction: A reaction in which one reactant gets oxidised while the other gets reduced simultaneously. Also called an oxidation-reduction reaction.\n\n18. Corrosion: The process by which a metal is attacked by substances around it such as moisture, acids, etc.\n\n19. Rancidity: The process by which fats and oils are oxidised, causing their smell and taste to change.\n\n20. Antioxidants: Substances which prevent oxidation, added to foods containing fats and oil."
    },
    {
      "lesson_id": "lesson_15_key_formulae_and_reactions",
      "lesson_title": "Key Chemical Equations and Reactions",
      "content_type": "formula",
      "content": "1. Burning of Magnesium:\n    2Mg(s) + O₂(g) → 2MgO(s)\n\n2. Zinc with Sulphuric Acid (Balanced):\n    Zn(s) + H₂SO₄(aq) → ZnSO₄(aq) + H₂(g)\n\n3. Iron with Steam (Balanced):\n    3Fe(s) + 4H₂O(g) → Fe₃O₄(s) + 4H₂(g)\n\n4. Slaked Lime Formation (Combination + Exothermic):\n    CaO(s) + H₂O(l) → Ca(OH)₂(aq) + Heat\n\n5. Whitewashing Reaction:\n    Ca(OH)₂(aq) + CO₂(g) → CaCO₃(s) + H₂O(l)\n\n6. Burning of Coal (Combination):\n    C(s) + O₂(g) → CO₂(g)\n\n7. Formation of Water (Combination):\n    2H₂(g) + O₂(g) → 2H₂O(l)\n\n8. Burning of Natural Gas (Exothermic):\n    CH₄(g) + 2O₂(g) → CO₂(g) + 2H₂O(g)\n\n9. Respiration (Exothermic):\n    C₆H₁₂O₆(aq) + 6O₂(aq) → 6CO₂(aq) + 6H₂O(l) + energy\n\n10. Decomposition of Ferrous Sulphate (Thermal):\n    2FeSO₄(s) → (Heat) → Fe₂O₃(s) + SO₂(g) + SO₃(g)\n\n11. Decomposition of Calcium Carbonate (Thermal):\n    CaCO₃(s) → (Heat) → CaO(s) + CO₂(g)\n\n12. Decomposition of Lead Nitrate (Thermal):\n    2Pb(NO₃)₂(s) → (Heat) → 2PbO(s) + 4NO₂(g) + O₂(g)\n\n13. Electrolysis of Water:\n    2H₂O(l) → (Electricity) → 2H₂(g) + O₂(g)\n\n14. Decomposition of Silver Chloride (by Light):\n    2AgCl(s) → (Sunlight) → 2Ag(s) + Cl₂(g)\n\n15. Decomposition of Silver Bromide (by Light):\n    2AgBr(s) → (Sunlight) → 2Ag(s) + Br₂(g)\n\n16. Displacement – Iron in Copper Sulphate:\n    Fe(s) + CuSO₄(aq) → FeSO₄(aq) + Cu(s)\n\n17. Displacement – Zinc in Copper Sulphate:\n    Zn(s) + CuSO₄(aq) → ZnSO₄(aq) + Cu(s)\n\n18. Displacement – Lead in Copper Chloride:\n    Pb(s) + CuCl₂(aq) → PbCl₂(aq) + Cu(s)\n\n19. Double Displacement – Precipitation:\n    Na₂SO₄(aq) + BaCl₂(aq) → BaSO₄(s) + 2NaCl(aq)\n\n20. Oxidation of Copper (Redox):\n    2Cu(s) + O₂(g) → (Heat) → 2CuO(s)\n\n21. Reduction of Copper Oxide (Redox):\n    CuO(s) + H₂(g) → (Heat) → Cu(s) + H₂O(l)\n\n22. Redox – ZnO with Carbon:\n    ZnO + C → Zn + CO\n\n23. Redox – MnO₂ with HCl:\n    MnO₂ + 4HCl → MnCl₂ + 2H₂O + Cl₂\n\n24. Synthesis of Methanol (Condition-based):\n    CO(g) + 2H₂(g) → (340 atm) → CH₃OH(l)\n\n25. Photosynthesis:\n    6CO₂(aq) + 12H₂O(l) → (Sunlight/Chlorophyll) → C₆H₁₂O₆(aq) + 6O₂(aq) + 6H₂O(l)"
    },
    {
      "lesson_id": "lesson_16_intext_questions",
      "lesson_title": "In-Text Questions",
      "content_type": "theory",
      "content": "Section 1.1 Questions:\n\n1. Why should a magnesium ribbon be cleaned before burning in air?\n\n2. Write the balanced equation for the following chemical reactions.\n   (i) Hydrogen + Chlorine → Hydrogen chloride\n   (ii) Barium chloride + Aluminium sulphate → Barium sulphate + Aluminium chloride\n   (iii) Sodium + Water → Sodium hydroxide + Hydrogen\n\n3. Write a balanced chemical equation with state symbols for the following reactions.\n   (i) Solutions of barium chloride and sodium sulphate in water react to give insoluble barium sulphate and the solution of sodium chloride.\n   (ii) Sodium hydroxide solution (in water) reacts with hydrochloric acid solution (in water) to produce sodium chloride solution and water.\n\n---\n\nSection 1.2.1 – 1.2.2 Questions:\n\n1. A solution of a substance 'X' is used for whitewashing.\n   (i) Name the substance 'X' and write its formula.\n   (ii) Write the reaction of the substance 'X' named in (i) above with water.\n\n2. Why is the amount of gas collected in one of the test tubes in the electrolysis of water double of the amount collected in the other? Name this gas.\n\n---\n\nSection 1.2.3 – 1.2.5 Questions:\n\n1. Why does the colour of copper sulphate solution change when an iron nail is dipped in it?\n\n2. Give an example of a double displacement reaction other than the one given in Activity 1.10.\n\n3. Identify the substances that are oxidised and the substances that are reduced in the following reactions.\n   (i) 4Na(s) + O₂(g) → 2Na₂O(s)\n   (ii) CuO(s) + H₂(g) → Cu(s) + H₂O(l)"
    },
    {
      "lesson_id": "lesson_17_exercises",
      "lesson_title": "Chapter Exercises",
      "content_type": "theory",
      "content": "1. Which of the statements about the reaction below are incorrect?\n   2PbO(s) + C(s) → 2Pb(s) + CO₂(g)\n   (a) Lead is getting reduced.\n   (b) Carbon dioxide is getting oxidised.\n   (c) Carbon is getting oxidised.\n   (d) Lead oxide is getting reduced.\n   Options: (i) (a) and (b)  (ii) (a) and (c)  (iii) (a), (b) and (c)  (iv) all\n\n2. Fe₂O₃ + 2Al → Al₂O₃ + 2Fe\n   The above reaction is an example of a\n   (a) combination reaction.\n   (b) double displacement reaction.\n   (c) decomposition reaction.\n   (d) displacement reaction.\n\n3. What happens when dilute hydrochloric acid is added to iron fillings? Tick the correct answer.\n   (a) Hydrogen gas and iron chloride are produced.\n   (b) Chlorine gas and iron hydroxide are produced.\n   (c) No reaction takes place.\n   (d) Iron salt and water are produced.\n\n4. What is a balanced chemical equation? Why should chemical equations be balanced?\n\n5. Translate the following statements into chemical equations and then balance them.\n   (a) Hydrogen gas combines with nitrogen to form ammonia.\n   (b) Hydrogen sulphide gas burns in air to give water and sulphur dioxide.\n   (c) Barium chloride reacts with aluminium sulphate to give aluminium chloride and a precipitate of barium sulphate.\n   (d) Potassium metal reacts with water to give potassium hydroxide and hydrogen gas.\n\n6. Balance the following chemical equations.\n   (a) HNO₃ + Ca(OH)₂ → Ca(NO₃)₂ + H₂O\n   (b) NaOH + H₂SO₄ → Na₂SO₄ + H₂O\n   (c) NaCl + AgNO₃ → AgCl + NaNO₃\n   (d) BaCl₂ + H₂SO₄ → BaSO₄ + HCl\n\n7. Write the balanced chemical equations for the following reactions.\n   (a) Calcium hydroxide + Carbon dioxide → Calcium carbonate + Water\n   (b) Zinc + Silver nitrate → Zinc nitrate + Silver\n   (c) Aluminium + Copper chloride → Aluminium chloride + Copper\n   (d) Barium chloride + Potassium sulphate → Barium sulphate + Potassium chloride\n\n8. Write the balanced chemical equation for the following and identify the type of reaction in each case.\n   (a) Potassium bromide(aq) + Barium iodide(aq) → Potassium iodide(aq) + Barium bromide(s)\n   (b) Zinc carbonate(s) → Zinc oxide(s) + Carbon dioxide(g)\n   (c) Hydrogen(g) + Chlorine(g) → Hydrogen chloride(g)\n   (d) Magnesium(s) + Hydrochloric acid(aq) → Magnesium chloride(aq) + Hydrogen(g)\n\n9. What does one mean by exothermic and endothermic reactions? Give examples.\n\n10. Why is respiration considered an exothermic reaction? Explain.\n\n11. Why are decomposition reactions called the opposite of combination reactions? Write equations for these reactions.\n\n12. Write one equation each for decomposition reactions where energy is supplied in the form of heat, light or electricity.\n\n13. What is the difference between displacement and double displacement reactions? Write equations for these reactions.\n\n14. In the refining of silver, the recovery of silver from silver nitrate solution involved displacement by copper metal. Write down the reaction involved.\n\n15. What do you mean by a precipitation reaction? Explain by giving examples.\n\n16. Explain the following in terms of gain or loss of oxygen with two examples each.\n    (a) Oxidation\n    (b) Reduction\n\n17. A shiny brown coloured element 'X' on heating in air becomes black in colour. Name the element 'X' and the black coloured compound formed.\n\n18. Why do we apply paint on iron articles?\n\n19. Oil and fat containing food items are flushed with nitrogen. Why?\n\n20. Explain the following terms with one example each.\n    (a) Corrosion\n    (b) Rancidity"
    }
  ]
}
