{
  "channel_id": "cbse_class10_science",
  "channel_name": "CBSE Class 10 Science",
  "class": "10",
  "subject": "Science",
  "chapter_id": "acids_bases_and_salts",
  "chapter_name": "Acids, Bases and Salts",
  "lessons": [
    {
      "lesson_id": "lesson_01_introduction_acids_bases",
      "lesson_title": "Introduction to Acids and Bases",
      "content_type": "theory",
      "content": "The sour and bitter tastes of food are due to acids and bases, respectively, present in them.\n\nYou already know that acids are sour in taste and change the colour of blue litmus to red, whereas, bases are bitter and change the colour of the red litmus to blue. Litmus is a natural indicator, turmeric is another such indicator.\n\nHave you noticed that a stain of curry on a white cloth becomes reddish-brown when soap, which is basic in nature, is scrubbed on it? It turns yellow again when the cloth is washed with plenty of water.\n\nYou can also use synthetic indicators such as methyl orange and phenolphthalein to test for acids and bases.\n\nIn this Chapter, we will study the reactions of acids and bases, how acids and bases cancel out each other's effects and many more interesting things that we use and see in our day-to-day life.\n\nDo You Know?\nLitmus solution is a purple dye, which is extracted from lichen, a plant belonging to the division Thallophyta, and is commonly used as an indicator. When the litmus solution is neither acidic nor basic, its colour is purple. There are many other natural materials like red cabbage leaves, turmeric, coloured petals of some flowers such as Hydrangea, Petunia and Geranium, which indicate the presence of acid or base in a solution. These are called acid-base indicators or sometimes simply indicators."
    },
    {
      "lesson_id": "lesson_02_acids_bases_laboratory",
      "lesson_title": "Acids and Bases in the Laboratory – Indicators",
      "content_type": "theory",
      "content": "Indicators tell us whether a substance is acidic or basic by change in colour.\n\nCommon indicators and their behaviour:\n\n    Indicator          | Colour with Acid  | Colour with Base\n    Red litmus         | No change (Red)   | Turns Blue\n    Blue litmus        | Turns Red         | No change (Blue)\n    Phenolphthalein    | Colourless        | Pink\n    Methyl orange      | Red               | Yellow\n\nThere are some substances whose odour changes in acidic or basic media. These are called olfactory indicators. Examples include onion and clove oil. Onion loses its smell in a basic solution (NaOH), but retains it in an acidic solution. Clove oil loses its characteristic smell in base. Vanilla essence retains its smell in both acid and base, so it cannot be used as an olfactory indicator."
    },
    {
      "lesson_id": "lesson_03_acids_bases_react_with_metals",
      "lesson_title": "How do Acids and Bases React with Metals?",
      "content_type": "theory",
      "content": "Reaction of Acids with Metals:\n\nWhen dilute sulphuric acid is added to zinc granules, bubbles of hydrogen gas are evolved. The metal displaces hydrogen atoms from the acid as hydrogen gas and forms a compound called a salt.\n\nThus, the reaction of a metal with an acid can be summarised as –\n\n    Acid + Metal → Salt + Hydrogen gas\n\nExample:\n    Zn + H₂SO₄ → ZnSO₄ + H₂\n    Fe + 2HCl → FeCl₂ + H₂\n\nThis reaction occurs with HCl, H₂SO₄, HNO₃, and CH₃COOH as well.\n\nReaction of Bases with Metals:\n\nWhen zinc granules are added to sodium hydroxide solution and warmed, hydrogen gas is again evolved. The reaction is:\n\n    2NaOH(aq) + Zn(s) → Na₂ZnO₂(s) + H₂(g)\n                          (Sodium zincate)\n\nHowever, such reactions are not possible with all metals."
    },
    {
      "lesson_id": "lesson_04_metal_carbonates_react_with_acids",
      "lesson_title": "How do Metal Carbonates and Metal Hydrogencarbonates React with Acids?",
      "content_type": "theory",
      "content": "When dilute hydrochloric acid is added to sodium carbonate and sodium hydrogencarbonate, carbon dioxide gas is evolved in both cases.\n\nReactions:\n\n    Na₂CO₃(s) + 2HCl(aq) → 2NaCl(aq) + H₂O(l) + CO₂(g)\n\n    NaHCO₃(s) + HCl(aq) → NaCl(aq) + H₂O(l) + CO₂(g)\n\nOn passing the carbon dioxide gas evolved through lime water:\n\n    Ca(OH)₂(aq) + CO₂(g) → CaCO₃(s) + H₂O(l)\n    (Lime water)             (White precipitate)\n\nThe lime water turns milky due to the formation of white precipitate of calcium carbonate. This is a standard test for carbon dioxide gas.\n\nOn passing excess carbon dioxide, the following reaction takes place:\n\n    CaCO₃(s) + H₂O(l) + CO₂(g) → Ca(HCO₃)₂(aq)\n                                    (Soluble in water)\n\nLimestone, chalk and marble are different forms of calcium carbonate.\n\nAll metal carbonates and hydrogencarbonates react with acids to give a corresponding salt, carbon dioxide and water.\n\nThus, the reaction can be summarised as –\n\n    Metal carbonate/Metal hydrogencarbonate + Acid → Salt + Carbon dioxide + Water"
    },
    {
      "lesson_id": "lesson_05_acids_bases_react_with_each_other",
      "lesson_title": "How do Acids and Bases React with Each Other? – Neutralisation Reaction",
      "content_type": "theory",
      "content": "When dilute HCl is added drop by drop to NaOH solution containing phenolphthalein indicator, the pink colour of phenolphthalein disappears. This indicates that the effect of the base is nullified by the acid.\n\nThe reaction taking place is:\n\n    NaOH(aq) + HCl(aq) → NaCl(aq) + H₂O(l)\n\nThe reaction between an acid and a base to give a salt and water is known as a neutralisation reaction. In general, a neutralisation reaction can be written as –\n\n    Base + Acid → Salt + Water"
    },
    {
      "lesson_id": "lesson_06_metallic_oxides_react_with_acids",
      "lesson_title": "Reaction of Metallic Oxides with Acids",
      "content_type": "theory",
      "content": "When a small amount of copper oxide is added to dilute hydrochloric acid with stirring, the colour of the solution becomes blue-green and the copper oxide dissolves.\n\nThe blue-green colour of the solution is due to the formation of copper(II) chloride in the reaction.\n\n    CuO + 2HCl → CuCl₂ + H₂O\n    (Copper oxide)  (Copper(II) chloride)\n\nThe general reaction between a metal oxide and an acid can be written as –\n\n    Metal oxide + Acid → Salt + Water\n\nSince metallic oxides react with acids to give salts and water, similar to the reaction of a base with an acid, metallic oxides are said to be basic oxides.\n\nReaction of a Non-metallic Oxide with Base:\n\nCalcium hydroxide (a base) reacts with carbon dioxide (a non-metallic oxide) to produce a salt and water:\n\n    Ca(OH)₂(aq) + CO₂(g) → CaCO₃(s) + H₂O(l)\n\nSince this is similar to the reaction between a base and an acid, we can conclude that non-metallic oxides are acidic in nature."
    },
    {
      "lesson_id": "lesson_07_what_acids_bases_have_in_common",
      "lesson_title": "What do All Acids and All Bases Have in Common?",
      "content_type": "theory",
      "content": "All acids generate hydrogen gas on reacting with metals. This suggests that hydrogen is common to all acids. However, not all compounds containing hydrogen are acidic. For example, glucose and alcohol also contain hydrogen but do not show acidic character.\n\nWhen acids such as HCl or H₂SO₄ are dissolved in water and electric current is passed through the solution, the bulb glows. This indicates a flow of electric current through the solution, carried by ions. However, glucose and alcohol solutions do not conduct electricity.\n\nAcids contain H⁺ ion as cation and anion such as Cl⁻ in HCl, NO₃⁻ in HNO₃, SO₄²⁻ in H₂SO₄, CH₃COO⁻ in CH₃COOH. Since the cation present in acids is H⁺, this suggests that acids produce hydrogen ions, H⁺(aq), in solution, which are responsible for their acidic properties.\n\nAll bases generate OH⁻ (hydroxide) ions in water. These OH⁻(aq) ions are responsible for the basic nature of a substance.\n\nBases which are soluble in water are called alkalis.\n\nDo You Know?\nAll bases do not dissolve in water. An alkali is a base that dissolves in water. They are soapy to touch, bitter and corrosive."
    },
    {
      "lesson_id": "lesson_08_acid_base_in_water_solution",
      "lesson_title": "What Happens to an Acid or a Base in a Water Solution?",
      "content_type": "theory",
      "content": "Acids produce ions only in aqueous solutions. Hydrogen ions in HCl are produced in the presence of water. The separation of H⁺ ion from HCl molecules cannot occur in the absence of water.\n\n    HCl + H₂O → H₃O⁺ + Cl⁻\n\nHydrogen ions cannot exist alone, but they exist after combining with water molecules. Thus hydrogen ions must always be shown as H⁺(aq) or hydronium ion (H₃O⁺).\n\n    H⁺ + H₂O → H₃O⁺\n\nWe have seen that acids give H₃O⁺ or H⁺(aq) ion in water. When a base is dissolved in water:\n\n    NaOH(s) → (H₂O) → Na⁺(aq) + OH⁻(aq)\n\n    KOH(s) → (H₂O) → K⁺(aq) + OH⁻(aq)\n\n    Mg(OH)₂(s) → (H₂O) → Mg²⁺(aq) + 2OH⁻(aq)\n\nBases generate hydroxide (OH⁻) ions in water.\n\nNow as we have identified that all acids generate H⁺(aq) and all bases generate OH⁻(aq), we can view the neutralisation reaction as follows –\n\n    Acid + Base → Salt + Water\n    H⁺(aq) + OH⁻(aq) → H₂O(l)\n\nDilution of Acid or Base:\n\nThe process of dissolving an acid or a base in water is a highly exothermic one. Care must be taken while mixing concentrated nitric acid or sulphuric acid with water. The acid must always be added slowly to water with constant stirring. If water is added to a concentrated acid, the heat generated may cause the mixture to splash out and cause burns. The glass container may also break due to excessive local heating.\n\nMixing an acid or base with water results in decrease in the concentration of ions (H₃O⁺/OH⁻) per unit volume. Such a process is called dilution and the acid or the base is said to be diluted."
    },
    {
      "lesson_id": "lesson_09_ph_scale",
      "lesson_title": "How Strong are Acid or Base Solutions? – The pH Scale",
      "content_type": "theory",
      "content": "We can quantitatively find the amount of H⁺ or OH⁻ ions present in a solution by making use of a universal indicator, which is a mixture of several indicators. The universal indicator shows different colours at different concentrations of hydrogen ions in a solution.\n\nA scale for measuring hydrogen ion concentration in a solution, called pH scale has been developed. The p in pH stands for 'potenz' in German, meaning power.\n\nOn the pH scale we can measure pH generally from 0 (very acidic) to 14 (very alkaline). pH should be thought of simply as a number which indicates the acidic or basic nature of a solution.\n\nKey facts about pH scale:\n• Higher the hydronium ion concentration, lower is the pH value.\n• The pH of a neutral solution is 7.\n• Values less than 7 on the pH scale represent an acidic solution.\n• As the pH value increases from 7 to 14, it represents an increase in OH⁻ ion concentration in the solution, that is, increase in the strength of alkali.\n• Generally paper impregnated with the universal indicator is used for measuring pH.\n\nStrong Acids and Weak Acids:\n\nThe strength of acids and bases depends on the number of H⁺ ions and OH⁻ ions produced, respectively. If we take hydrochloric acid and acetic acid of the same concentration, say one molar, then these produce different amounts of hydrogen ions. Acids that give rise to more H⁺ ions are said to be strong acids, and acids that give less H⁺ ions are said to be weak acids."
    },
    {
      "lesson_id": "lesson_10_importance_of_ph_in_everyday_life",
      "lesson_title": "Importance of pH in Everyday Life",
      "content_type": "theory",
      "content": "Are plants and animals pH sensitive?\n\nOur body works within the pH range of 7.0 to 7.8. Living organisms can survive only in a narrow range of pH change. When pH of rain water is less than 5.6, it is called acid rain. When acid rain flows into the rivers, it lowers the pH of the river water. The survival of aquatic life in such rivers becomes difficult.\n\nWhat is the pH of the soil in your backyard?\n\nPlants require a specific pH range for their healthy growth.\n\npH in our digestive system:\n\nOur stomach produces hydrochloric acid. It helps in the digestion of food without harming the stomach. During indigestion the stomach produces too much acid and this causes pain and irritation. To get rid of this pain, people use bases called antacids. These antacids neutralise the excess acid. Magnesium hydroxide (Milk of magnesia), a mild base, is often used for this purpose.\n\npH change as the cause of tooth decay:\n\nTooth decay starts when the pH of the mouth is lower than 5.5. Tooth enamel, made up of calcium hydroxyapatite (a crystalline form of calcium phosphate) is the hardest substance in the body. It does not dissolve in water, but is corroded when the pH in the mouth is below 5.5. Bacteria present in the mouth produce acids by degradation of sugar and food particles remaining in the mouth after eating. The best way to prevent this is to clean the mouth after eating food. Using toothpastes, which are generally basic, for cleaning the teeth can neutralise the excess acid and prevent tooth decay.\n\nSelf defence by animals and plants through chemical warfare:\n\nHave you ever been stung by a honey-bee? Bee-sting leaves an acid which causes pain and irritation. Use of a mild base like baking soda on the stung area gives relief. Stinging hair of nettle leaves inject methanoic acid causing burning pain.\n\nDo You Know – Acids in other planets:\nThe atmosphere of Venus is made up of thick white and yellowish clouds of sulphuric acid.\n\nNature provides neutralisation options:\nNettle is a herbaceous plant which grows in the wild. Its leaves have stinging hair, which cause painful stings when touched accidentally. This is due to the methanoic acid secreted by them. A traditional remedy is rubbing the area with the leaf of the dock plant, which often grows beside the nettle in the wild."
    },
    {
      "lesson_id": "lesson_11_naturally_occurring_acids",
      "lesson_title": "Naturally Occurring Acids",
      "content_type": "theory",
      "content": "Table: Some Naturally Occurring Acids\n\n    Natural Source    | Acid\n    Vinegar           | Acetic acid\n    Orange            | Citric acid\n    Tamarind          | Tartaric acid\n    Tomato            | Oxalic acid\n    Sour milk (Curd)  | Lactic acid\n    Lemon             | Citric acid\n    Ant sting         | Methanoic acid\n    Nettle sting      | Methanoic acid"
    },
    {
      "lesson_id": "lesson_12_family_of_salts",
      "lesson_title": "More About Salts – Family of Salts and pH of Salts",
      "content_type": "theory",
      "content": "Family of Salts:\n\nSalts having the same positive or negative radicals are said to belong to a family. For example, NaCl and Na₂SO₄ belong to the family of sodium salts. Similarly, NaCl and KCl belong to the family of chloride salts.\n\npH of Salts:\n\nSalts of a strong acid and a strong base are neutral with pH value of 7.\n\nSalts of a strong acid and weak base are acidic with pH value less than 7.\n\nSalts of a strong base and weak acid are basic in nature, with pH value more than 7.\n\nCommon Salt – A Raw Material for Chemicals:\n\nThe common salt (sodium chloride) is an important raw material for various materials of daily use, such as sodium hydroxide, baking soda, washing soda, bleaching powder and many more.\n\nSeawater contains many salts dissolved in it. Sodium chloride is separated from these salts. Deposits of solid salt are also found in several parts of the world. These large crystals are often brown due to impurities. This is called rock salt. Beds of rock salt were formed when seas of bygone ages dried up. Rock salt is mined like coal."
    },
    {
      "lesson_id": "lesson_13_sodium_hydroxide_chlor_alkali",
      "lesson_title": "Chemicals from Common Salt – Sodium Hydroxide and Chlor-Alkali Process",
      "content_type": "theory",
      "content": "Sodium Hydroxide:\n\nWhen electricity is passed through an aqueous solution of sodium chloride (called brine), it decomposes to form sodium hydroxide. The process is called the chlor-alkali process because of the products formed – chlor for chlorine and alkali for sodium hydroxide.\n\n    2NaCl(aq) + 2H₂O(l) → 2NaOH(aq) + Cl₂(g) + H₂(g)\n\nIn this process:\n• Chlorine gas is given off at the anode.\n• Hydrogen gas is given off at the cathode.\n• Sodium hydroxide solution is formed near the cathode.\n\nThe three products produced in this process are all useful:\n\nUses of Chlorine:\n• Water treatment, swimming pools\n• PVC, disinfectants, CFCs, pesticides\n\nUses of Hydrogen:\n• Fuels, margarine, ammonia for fertilisers\n\nUses of Sodium Hydroxide (NaOH):\n• De-greasing metals\n• Soaps and detergents\n• Paper making\n• Artificial fibres"
    },
    {
      "lesson_id": "lesson_14_bleaching_powder",
      "lesson_title": "Chemicals from Common Salt – Bleaching Powder",
      "content_type": "theory",
      "content": "Bleaching Powder:\n\nChlorine gas produced during the electrolysis of aqueous sodium chloride (brine) is used for the manufacture of bleaching powder. Bleaching powder is produced by the action of chlorine on dry slaked lime [Ca(OH)₂]. Bleaching powder is represented as Ca(ClO)₂, though the actual composition is quite complex.\n\n    2Ca(OH)₂ + 2Cl₂ → Ca(ClO)₂ + CaCl₂ + 2H₂O\n\nBleaching powder is used –\n(i) For bleaching cotton and linen in the textile industry, for bleaching wood pulp in paper factories and for bleaching washed clothes in laundry.\n(ii) As an oxidising agent in many chemical industries.\n(iii) To make drinking water free from germs."
    },
    {
      "lesson_id": "lesson_15_baking_soda",
      "lesson_title": "Chemicals from Common Salt – Baking Soda",
      "content_type": "theory",
      "content": "Baking Soda:\n\nBaking soda is commonly used in the kitchen for making tasty crispy pakoras, etc. Sometimes it is added for faster cooking. The chemical name of the compound is sodium hydrogencarbonate (NaHCO₃). It is produced using sodium chloride as one of the raw materials.\n\n    NaCl + H₂O + CO₂ + NH₃ → NH₄Cl + NaHCO₃\n                               (Ammonium  (Sodium\n                                chloride)   hydrogencarbonate)\n\nIt is a mild non-corrosive basic salt. The following reaction takes place when it is heated during cooking –\n\n    2NaHCO₃ → (Heat) → Na₂CO₃ + H₂O + CO₂\n    (Sodium              (Sodium\n    hydrogencarbonate)   carbonate)\n\nUses of Baking Soda:\n\n(i) For making baking powder, which is a mixture of baking soda (sodium hydrogencarbonate) and a mild edible acid such as tartaric acid. When baking powder is heated or mixed in water:\n\n    NaHCO₃ + H⁺ → CO₂ + H₂O + Sodium salt of acid\n    (From any acid)\n\n    Carbon dioxide produced during the reaction can cause bread or cake to rise making them soft and spongy.\n\n(ii) Sodium hydrogencarbonate is also an ingredient in antacids. Being alkaline, it neutralises excess acid in the stomach and provides relief.\n\n(iii) It is also used in soda-acid fire extinguishers."
    },
    {
      "lesson_id": "lesson_16_washing_soda",
      "lesson_title": "Chemicals from Common Salt – Washing Soda",
      "content_type": "theory",
      "content": "Washing Soda:\n\nAnother chemical that can be obtained from sodium chloride is Na₂CO₃.10H₂O (washing soda). Sodium carbonate can be obtained by heating baking soda; recrystallisation of sodium carbonate gives washing soda. It is also a basic salt.\n\n    Na₂CO₃ + 10H₂O → Na₂CO₃.10H₂O\n    (Sodium carbonate)\n\nSodium carbonate and sodium hydrogencarbonate are useful chemicals for many industrial processes as well.\n\nUses of Washing Soda:\n\n(i) Sodium carbonate (washing soda) is used in glass, soap and paper industries.\n(ii) It is used in the manufacture of sodium compounds such as borax.\n(iii) Sodium carbonate can be used as a cleaning agent for domestic purposes.\n(iv) It is used for removing permanent hardness of water."
    },
    {
      "lesson_id": "lesson_17_water_of_crystallisation",
      "lesson_title": "Are the Crystals of Salts Really Dry? – Water of Crystallisation",
      "content_type": "theory",
      "content": "Water of Crystallisation:\n\nCopper sulphate crystals which seem to be dry contain water of crystallisation. When we heat the crystals, this water is removed and the salt turns white. If you moisten the crystals again with water, you will find that blue colour of the crystals reappears.\n\nWater of crystallisation is the fixed number of water molecules present in one formula unit of a salt.\n\nFive water molecules are present in one formula unit of copper sulphate. Chemical formula for hydrated copper sulphate is CuSO₄.5H₂O.\n\nOne other salt which possesses water of crystallisation is gypsum. It has two water molecules as water of crystallisation. It has the chemical formula CaSO₄.2H₂O.\n\nPlaster of Paris:\n\nOn heating gypsum at 373 K, it loses water molecules and becomes calcium sulphate hemihydrate (CaSO₄. ½H₂O). This is called Plaster of Paris, the substance which doctors use as plaster for supporting fractured bones in the right position.\n\nPlaster of Paris is a white powder and on mixing with water, it changes to gypsum once again giving a hard solid mass.\n\n    CaSO₄.½H₂O + 1½H₂O → CaSO₄.2H₂O\n    (Plaster of Paris)        (Gypsum)\n\nNote that only half a water molecule is shown to be attached as water of crystallisation. It is written in this form because two formula units of CaSO₄ share one molecule of water.\n\nPlaster of Paris is used for making toys, materials for decoration and for making surfaces smooth."
    },
    {
      "lesson_id": "lesson_18_chapter_summary",
      "lesson_title": "Chapter Summary – What You Have Learnt",
      "content_type": "theory",
      "content": "• Acid-base indicators are dyes or mixtures of dyes which are used to indicate the presence of acids and bases.\n\n• Acidic nature of a substance is due to the formation of H⁺(aq) ions in solution. Formation of OH⁻(aq) ions in solution is responsible for the basic nature of a substance.\n\n• When an acid reacts with a metal, hydrogen gas is evolved and a corresponding salt is formed.\n\n• When a base reacts with a metal, along with the evolution of hydrogen gas a salt is formed which has a negative ion composed of the metal and oxygen.\n\n• When an acid reacts with a metal carbonate or metal hydrogencarbonate, it gives the corresponding salt, carbon dioxide gas and water.\n\n• Acidic and basic solutions in water conduct electricity because they produce hydrogen and hydroxide ions respectively.\n\n• The strength of an acid or an alkali can be tested by using a scale called the pH scale (0-14) which gives the measure of hydrogen ion concentration in a solution.\n\n• A neutral solution has a pH of exactly 7, while an acidic solution has a pH less than 7 and a basic solution a pH more than 7.\n\n• Living beings carry out their metabolic activities within an optimal pH range.\n\n• Mixing concentrated acids or bases with water is a highly exothermic process.\n\n• Acids and bases neutralise each other to form corresponding salts and water.\n\n• Water of crystallisation is the fixed number of water molecules present in one formula unit of a salt.\n\n• Salts have various uses in everyday life and in industries."
    },
    {
      "lesson_id": "lesson_19_key_definitions",
      "lesson_title": "Key Definitions",
      "content_type": "definition",
      "content": "1. Acid: A substance that is sour in taste, turns blue litmus red, and produces H⁺(aq) or H₃O⁺ ions in aqueous solution.\n\n2. Base: A substance that is bitter in taste, turns red litmus blue, and produces OH⁻(aq) ions in aqueous solution.\n\n3. Alkali: A base that dissolves in water. They are soapy to touch, bitter and corrosive.\n\n4. Indicator: A dye or mixture of dyes used to indicate the presence of acids and bases by a change in colour.\n\n5. Olfactory Indicator: Substances whose odour changes in acidic or basic media. Examples: onion, clove oil.\n\n6. Neutralisation Reaction: The reaction between an acid and a base to give a salt and water.\n\n7. Hydronium ion (H₃O⁺): The ion formed when hydrogen ion (H⁺) combines with a water molecule. Hydrogen ions cannot exist alone; they must always be shown as H⁺(aq) or hydronium ion (H₃O⁺).\n\n8. pH Scale: A scale for measuring hydrogen ion concentration in a solution, ranging from 0 (very acidic) to 14 (very alkaline). The p in pH stands for 'potenz' in German, meaning power.\n\n9. Universal Indicator: A mixture of several indicators that shows different colours at different concentrations of hydrogen ions in a solution.\n\n10. Strong Acid: An acid that gives rise to more H⁺ ions in solution.\n\n11. Weak Acid: An acid that gives less H⁺ ions in solution.\n\n12. Acid Rain: Rain water with pH less than 5.6.\n\n13. Antacid: A base used to neutralise excess acid produced in the stomach during indigestion. Example: Magnesium hydroxide (Milk of magnesia).\n\n14. Salt: A compound formed by the reaction of an acid and a base (neutralisation reaction).\n\n15. Brine: An aqueous solution of sodium chloride (NaCl).\n\n16. Chlor-Alkali Process: The process in which electricity is passed through brine (aqueous NaCl) to produce sodium hydroxide, chlorine and hydrogen.\n\n17. Bleaching Powder: A chemical produced by the action of chlorine on dry slaked lime [Ca(OH)₂]. Represented as Ca(ClO)₂.\n\n18. Baking Soda: Sodium hydrogencarbonate (NaHCO₃). A mild non-corrosive basic salt used in cooking and as an antacid.\n\n19. Baking Powder: A mixture of baking soda (sodium hydrogencarbonate) and a mild edible acid such as tartaric acid.\n\n20. Washing Soda: Sodium carbonate decahydrate (Na₂CO₃.10H₂O). A basic salt used in glass, soap and paper industries and for removing permanent hardness of water.\n\n21. Water of Crystallisation: The fixed number of water molecules present in one formula unit of a salt.\n\n22. Gypsum: Calcium sulphate dihydrate (CaSO₄.2H₂O). A salt possessing water of crystallisation.\n\n23. Plaster of Paris: Calcium sulphate hemihydrate (CaSO₄.½H₂O). Obtained by heating gypsum at 373 K. Used for supporting fractured bones and making decorative items.\n\n24. Dilution: The process of mixing an acid or base with water, resulting in decrease in the concentration of ions (H₃O⁺/OH⁻) per unit volume.\n\n25. Basic Oxide: A metallic oxide that reacts with acids to give salts and water.\n\n26. Acidic Oxide: A non-metallic oxide that reacts with bases to give salts and water."
    },
    {
      "lesson_id": "lesson_20_key_formulae_and_reactions",
      "lesson_title": "Key Chemical Equations and Reactions",
      "content_type": "formula",
      "content": "Reactions of Acids with Metals:\n    Acid + Metal → Salt + Hydrogen gas\n    Zn + H₂SO₄ → ZnSO₄ + H₂\n    Fe + 2HCl → FeCl₂ + H₂\n\nReaction of Base with Metal:\n    2NaOH(aq) + Zn(s) → Na₂ZnO₂(s) + H₂(g)  [Sodium zincate]\n\nReactions of Acids with Metal Carbonates and Hydrogencarbonates:\n    Na₂CO₃(s) + 2HCl(aq) → 2NaCl(aq) + H₂O(l) + CO₂(g)\n    NaHCO₃(s) + HCl(aq) → NaCl(aq) + H₂O(l) + CO₂(g)\n\nLime water test for CO₂:\n    Ca(OH)₂(aq) + CO₂(g) → CaCO₃(s) + H₂O(l)  [White precipitate]\n\nExcess CO₂ with CaCO₃:\n    CaCO₃(s) + H₂O(l) + CO₂(g) → Ca(HCO₃)₂(aq)  [Soluble]\n\nNeutralisation Reaction:\n    NaOH(aq) + HCl(aq) → NaCl(aq) + H₂O(l)\n    Base + Acid → Salt + Water\n    H⁺(aq) + OH⁻(aq) → H₂O(l)\n\nMetallic Oxide with Acid:\n    CuO + 2HCl → CuCl₂ + H₂O\n    Metal oxide + Acid → Salt + Water\n\nNon-metallic Oxide with Base:\n    Ca(OH)₂(aq) + CO₂(g) → CaCO₃(s) + H₂O(l)\n\nDissociation of HCl in Water:\n    HCl + H₂O → H₃O⁺ + Cl⁻\n    H⁺ + H₂O → H₃O⁺\n\nDissociation of Bases in Water:\n    NaOH(s) → (H₂O) → Na⁺(aq) + OH⁻(aq)\n    KOH(s) → (H₂O) → K⁺(aq) + OH⁻(aq)\n    Mg(OH)₂(s) → (H₂O) → Mg²⁺(aq) + 2OH⁻(aq)\n\nChlor-Alkali Process:\n    2NaCl(aq) + 2H₂O(l) → 2NaOH(aq) + Cl₂(g) + H₂(g)\n\nProduction of Bleaching Powder:\n    2Ca(OH)₂ + 2Cl₂ → Ca(ClO)₂ + CaCl₂ + 2H₂O\n\nProduction of Baking Soda:\n    NaCl + H₂O + CO₂ + NH₃ → NH₄Cl + NaHCO₃\n\nHeating of Baking Soda:\n    2NaHCO₃ → (Heat) → Na₂CO₃ + H₂O + CO₂\n\nBaking Soda with Acid:\n    NaHCO₃ + H⁺ → CO₂ + H₂O + Sodium salt of acid\n\nProduction of Washing Soda:\n    Na₂CO₃ + 10H₂O → Na₂CO₃.10H₂O\n\nHeating of Gypsum to form Plaster of Paris:\n    CaSO₄.2H₂O → (373 K) → CaSO₄.½H₂O + 1½H₂O\n    (Gypsum)                  (Plaster of Paris)\n\nPlaster of Paris with Water:\n    CaSO₄.½H₂O + 1½H₂O → CaSO₄.2H₂O\n    (Plaster of Paris)        (Gypsum)"
    },
    {
      "lesson_id": "lesson_21_intext_questions",
      "lesson_title": "In-Text Questions",
      "content_type": "theory",
      "content": "Section 2.1 Question:\n\n1. You have been provided with three test tubes. One of them contains distilled water and the other two contain an acidic solution and a basic solution, respectively. If you are given only red litmus paper, how will you identify the contents of each test tube?\n\n---\n\nSection 2.1.1 – 2.1.6 Questions:\n\n1. Why should curd and sour substances not be kept in brass and copper vessels?\n\n2. Which gas is usually liberated when an acid reacts with a metal? Illustrate with an example. How will you test for the presence of this gas?\n\n3. Metal compound A reacts with dilute hydrochloric acid to produce effervescence. The gas evolved extinguishes a burning candle. Write a balanced chemical equation for the reaction if one of the compounds formed is calcium chloride.\n\n---\n\nSection 2.2 Questions:\n\n1. Why do HCl, HNO₃, etc., show acidic characters in aqueous solutions while solutions of compounds like alcohol and glucose do not show acidic character?\n\n2. Why does an aqueous solution of an acid conduct electricity?\n\n3. Why does dry HCl gas not change the colour of the dry litmus paper?\n\n4. While diluting an acid, why is it recommended that the acid should be added to water and not water to the acid?\n\n5. How is the concentration of hydronium ions (H₃O⁺) affected when a solution of an acid is diluted?\n\n6. How is the concentration of hydroxide ions (OH⁻) affected when excess base is dissolved in a solution of sodium hydroxide?\n\n---\n\nSection 2.3 Questions:\n\n1. You have two solutions, A and B. The pH of solution A is 6 and pH of solution B is 8. Which solution has more hydrogen ion concentration? Which of this is acidic and which one is basic?\n\n2. What effect does the concentration of H⁺(aq) ions have on the nature of the solution?\n\n3. Do basic solutions also have H⁺(aq) ions? If yes, then why are these basic?\n\n4. Under what soil condition do you think a farmer would treat the soil of his fields with quick lime (calcium oxide) or slaked lime (calcium hydroxide) or chalk (calcium carbonate)?\n\n---\n\nSection 2.4 Questions:\n\n1. What is the common name of the compound Ca(ClO)₂?\n\n2. Name the substance which on treatment with chlorine yields bleaching powder.\n\n3. Name the sodium compound which is used for softening hard water.\n\n4. What will happen if a solution of sodium hydrogencarbonate is heated? Give the equation of the reaction involved.\n\n5. Write an equation to show the reaction between Plaster of Paris and water."
    },
    {
      "lesson_id": "lesson_22_exercises",
      "lesson_title": "Chapter Exercises",
      "content_type": "theory",
      "content": "1. A solution turns red litmus blue, its pH is likely to be\n   (a) 1  (b) 4  (c) 5  (d) 10\n\n2. A solution reacts with crushed egg-shells to give a gas that turns lime-water milky. The solution contains\n   (a) NaCl  (b) HCl  (c) LiCl  (d) KCl\n\n3. 10 mL of a solution of NaOH is found to be completely neutralised by 8 mL of a given solution of HCl. If we take 20 mL of the same solution of NaOH, the amount HCl solution (the same solution as before) required to neutralise it will be\n   (a) 4 mL  (b) 8 mL  (c) 12 mL  (d) 16 mL\n\n4. Which one of the following types of medicines is used for treating indigestion?\n   (a) Antibiotic\n   (b) Analgesic\n   (c) Antacid\n   (d) Antiseptic\n\n5. Write word equations and then balanced equations for the reaction taking place when –\n   (a) dilute sulphuric acid reacts with zinc granules.\n   (b) dilute hydrochloric acid reacts with magnesium ribbon.\n   (c) dilute sulphuric acid reacts with aluminium powder.\n   (d) dilute hydrochloric acid reacts with iron filings.\n\n6. Compounds such as alcohols and glucose also contain hydrogen but are not categorised as acids. Describe an Activity to prove it.\n\n7. Why does distilled water not conduct electricity, whereas rain water does?\n\n8. Why do acids not show acidic behaviour in the absence of water?\n\n9. Five solutions A, B, C, D and E when tested with universal indicator showed pH as 4, 1, 11, 7 and 9, respectively. Which solution is\n   (a) neutral?\n   (b) strongly alkaline?\n   (c) strongly acidic?\n   (d) weakly acidic?\n   (e) weakly alkaline?\n   Arrange the pH in increasing order of hydrogen-ion concentration.\n\n10. Equal lengths of magnesium ribbons are taken in test tubes A and B. Hydrochloric acid (HCl) is added to test tube A, while acetic acid (CH₃COOH) is added to test tube B. Amount and concentration taken for both the acids are same. In which test tube will the fizzing occur more vigorously and why?\n\n11. Fresh milk has a pH of 6. How do you think the pH will change as it turns into curd? Explain your answer.\n\n12. A milkman adds a very small amount of baking soda to fresh milk.\n    (a) Why does he shift the pH of the fresh milk from 6 to slightly alkaline?\n    (b) Why does this milk take a long time to set as curd?\n\n13. Plaster of Paris should be stored in a moisture-proof container. Explain why?\n\n14. What is a neutralisation reaction? Give two examples.\n\n15. Give two important uses of washing soda and baking soda."
    }
  ]
}
